{
  "projects": [
    {
      "title": "Wonderland of the West",
      "description": "A simple line-art piece I made as an ode to the city I was born and raised in. Designed with Adobe Illustrator.",
      "date": "January 2017",
      "product": "T-Shirt/Sticker Design",
      "service": "Design",
      "thumbnail": "SanFranciscoBadge.png"
    },
    {
      "title": "BeerMe!",
      "description": "BeerMe is a forthcoming app for ordering drinks to your seat at any major sports stadium. The client, an iOS developer, had built a fully functional app but had done nothing with the design or branding, using common stock images/elements in place of actual UI components. In desperate need of a visual overhaul, I stepped in and completely reskinned the app, providing the logo, colour palette, illustrations, UX and UI. Designed with Adobe Illustrator and prototyped with Experience Design.",
      "date": "January 2017",
      "product": "Mobile App",
      "service": "Design, Illustration, UX, UI",
      "thumbnail": "BeerMe.png"
    },
    {
      "title": "Ulti-Mate",
      "description": "Product promotional poster for print that was commissioned by Ulti-Mate, a major manufacturer of domestic and industrial cleaning chemicals in the Caribbean. Designed with Adobe Illustrator and Photoshop",
      "date": "December 2016",
      "product": "Marketing Material",
      "service": "Design",
      "thumbnail": "Ulti-Mate.png"
    },
    {
      "title": "Shades Of Shadow",
      "description": "Album cover artwork commissioned for 'Shades of Shadow', a jazz album by musician Chris Colton. Chris provided me with a high resolution black & white portrait which I painted over in Adobe Illustrator, evoking the rotoscoped style of Richard Linklater films, 'A Scanner Darkly' and 'Waking life'. Designed with Adobe Illustrator and Photoshop.",
      "date": "August 2016",
      "product": "Album Cover Artwork",
      "service": "Design, Illustration",
      "thumbnail": "ShadesOfShadow.png"
    },
    {
      "title": "Finding it And Losing It",
      "description": "Single cover artwork for 'Finding it and Losing It', an experimental electronic album by jazz duo, RVRSAL. This piece was commissioned for a promotional single which, at the time, was called, 'Refract'. The duo wanted something psychedelic and unnerving; much like the music they create. I drew inspiration from the Christopher Nolan film, 'Inception', as well as the early trailers for Marvel's 'Doctor Strange'. Designed with Adobe Illustrator and Photoshop.",
      "date": "June 2016",
      "product": "Single Cover Artwork",
      "service": "Design, Illustration",
      "thumbnail": "FindingItAndLosingIt-Single.png"
    },
    {
      "title": "Bonjour Hi",
      "description": "Official poster of Bonjour Hi, a feature length short film collection about life in Montreal. Each of the four films of Bonjour Hi takes place at different times at iconic locations in the city of Montreal. I used textured gradients to illustrate the passing of time from Morning to Night behind the iconic skyline of the Montreal cityscape. Designed with Adobe Photoshop, Illustrator and InDesign.",
      "date": "November 2015",
      "product": "Movie Poster",
      "service": "Design, Illustration, Marketing",
      "thumbnail": "BonjourHi.png"
    },
    {
      "title": "Volt",
      "description": "Marketing and social media banner for Volt, a stungun phone case and corresponding iOS app. The challenge here was to create a highly effective and quirky visual that diverged from typical self-defense marketing which tend to exploit the viewer's fear of kidnapping or assault. Designed with Adobe Illustrator",
      "date": "August 2015",
      "product": "Marketing Material",
      "service": "Design, Illustration, Marketing",
      "thumbnail": "Volt.png"
    },
    {
      "title": "Pacific Gold Agriculture",
      "description": "Here's the design I pitched to Pacific Gold Agriculture when they decided to redesign their overall brand and visual identity. Since many of their business partners are from Asia, they wanted a logo that evoked Japanese aesthetic without losing their identity as an agricultural company. Designed with Adobe Illustrator.",
      "date": "August 2015",
      "product": "Brand Logo",
      "service": "Design",
      "thumbnail": "PacificGoldAgriculture.png"
    }
  ]
}
